[
    {
        "name": "Exploring the Atacama Desert",
        "category": "Nature",
        "score": 5,
        "description": "Discover the otherworldly landscapes of the Atacama Desert, known for its salt flats, geysers, and stargazing opportunities.",
        "city": "San Pedro de Atacama",
        "longitude": -68.1997,
        "latitude": -22.9083,
        "cost": "$$",
        "best_time_to_go": ["April", "May", "September", "October"],
        "best_time_to_go_description": "The best time to visit the Atacama Desert is during the shoulder months of April, May, September, and October. During these months, the temperatures are more moderate, making outdoor activities and exploration more comfortable. Additionally, these months offer clearer skies, ideal for stargazing and observing the stunning desert landscapes.",
        "worst_time_to_go": ["December", "January", "February"],
        "worst_time_to_go_description": "The summer months of December, January, and February are the least ideal for visiting the Atacama Desert due to the extremely high temperatures, which can make outdoor activities uncomfortable and even dangerous. The intense heat during these months can also lead to less clear skies, affecting stargazing opportunities.",
        "suggested_venues": [
            {
                "name": "Valle de la Luna",
                "description": "A surreal landscape resembling the moon's surface, offering breathtaking views of rock formations and dunes. Ideal for hiking and watching sunsets.",
                "location": "Valle de la Luna, Atacama Desert, Chile",
                "imageUrl":"assets/images/venues/chile/luna.png"
            },
            {
                "name": "El Tatio Geysers",
                "description": "One of the highest-elevation geyser fields in the world. Best visited at dawn when the geysers are most active, creating a spectacular natural show.",
                "location": "El Tatio, Atacama Desert, Chile",
                "imageUrl":"assets/images/venues/chile/tatiogeysers.png"
            },
            {
                "name": "Salar de Atacama",
                "description": "The largest salt flat in Chile, known for its vast white landscapes and home to flamingos and other wildlife. Offers unique photography opportunities.",
                "location": "Salar de Atacama, Atacama Desert, Chile",
                "imageUrl":"assets/images/venues/chile/salaratacama.png"
            }
        ]
    },

    {
        "name": "Hiking in Torres del Paine National Park",
        "category": "Nature",
        "score": 5,
        "description": "Embark on a trekking adventure in the stunning Torres del Paine National Park, famous for its rugged beauty and iconic granite peaks.",
        "city": "Puerto Natales",
        "longitude": -72.5067,
        "latitude": -51.2594,
        "cost": "$$$",
        "best_time_to_go": ["October", "November", "December", "March", "April"],
        "best_time_to_go_description": "The ideal months to visit Torres del Paine are during the spring and autumn months of October, November, December, March, and April. These months offer milder weather, fewer crowds, and the park's natural beauty is at its peak with blooming flowers and vibrant foliage.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June, July, and August are less ideal for hiking in Torres del Paine due to the harsh weather conditions. The cold temperatures, snow, and shorter days can make trekking difficult and some trails may be inaccessible.",
        "suggested_venues": [
            {
                "name": "The W Trek",
                "description": "A popular multi-day trek covering the park's major highlights, including the Grey Glacier, French Valley, and the Base of the Towers.",
                "location": "Torres del Paine National Park, Chile",
                "imageUrl":"assets/images/venues/chile/wtrek.png"
            },
            {
                "name": "The O Circuit",
                "description": "An extended version of the W Trek, this challenging route offers a complete circuit around the Paine Massif with stunning views and diverse landscapes.",
                "location": "Torres del Paine National Park, Chile",
                "imageUrl":"assets/images/venues/chile/ocircuit.png"
            },
            {
                "name": "Base of the Towers Trail",
                "description": "A day hike leading to the iconic base of the three towers, offering breathtaking views and photo opportunities of the park's most famous landmarks.",
                "location": "Torres del Paine National Park, Chile",
                "imageUrl":"assets/images/venues/chile/towerstrail.png"
            }
        ]
    },


    {
        "name": "Cruising through Patagonian Fjords",
        "category": "Adventure",
        "score": 5,
        "description": "Take a cruise through the mesmerizing Patagonian fjords, surrounded by glaciers, mountains, and pristine waters.",
        "city": "Punta Arenas",
        "longitude": -70.9171,
        "latitude": -53.1638,
        "cost": "$$$",
        "best_time_to_go": ["November", "December", "January", "February", "March"],
        "best_time_to_go_description": "The ideal time to cruise through the Patagonian Fjords is during the Southern Hemisphere summer months of November to March. This period offers milder weather, longer daylight hours, and better wildlife viewing opportunities.",
        "worst_time_to_go": ["May", "June", "July", "August"],
        "worst_time_to_go_description": "The winter months of May to August are less favorable for cruising due to colder temperatures, rougher sea conditions, and limited daylight hours, which can impact the overall experience.",
        "suggested_venues": [
            {
                "name": "Beagle Channel",
                "description": "Famous for its historical significance and stunning natural beauty, offering views of sea lions, penguins, and glaciers.",
                "location": "Beagle Channel, Chile",
                "longitude": -68.1833,
                "latitude": -55.0000,
                "imageUrl":"assets/images/venues/chile/beaglechannel.png"
            },
            {
                "name": "Cape Horn",
                "description": "Known as the southernmost point of South America, Cape Horn is a legendary maritime landmark with dramatic ocean vistas.",
                "location": "Cape Horn, Chile",
                "longitude": -67.2636,
                "latitude": -55.9833,
                "imageUrl":"assets/images/venues/chile/capehorn.png"
            },
            {
                "name": "Glacier Alley",
                "description": "A passage along the fjords featuring several impressive glaciers descending from the Darwin Mountain Range, each named after a European country.",
                "location": "Glacier Alley, Chile",
                "longitude": -70.9167,
                "latitude": -54.0833,
                "imageUrl":"assets/images/venues/chile/glacieralley.png"
            }
        ]
    },


    {
        "name": "Wine Tasting in the Colchagua Valley",
        "category": "Food",
        "score": 4,
        "description": "Indulge in wine tasting at the vineyards of the Colchagua Valley, renowned for its fine Chilean wines.",
        "city": "Santa Cruz",
        "longitude": -71.3395,
        "latitude": -34.6268,
        "cost": "$$",
        "best_time_to_go": ["March", "April", "May"],
        "best_time_to_go_description": "The best time to visit the Colchagua Valley for wine tasting is during the autumn months of March, April, and May. This period coincides with the grape harvest season, offering visitors the chance to experience the winemaking process up close and enjoy the freshest wines.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June, July, and August are less ideal for wine tasting tours due to colder weather and reduced vineyard activities. Many wineries may have limited hours or tours during this off-season.",
        "suggested_venues": [
            {
                "name": "Viña Montes",
                "description": "Known for its innovative winemaking techniques and premium wines, Viña Montes offers guided tours and tastings in a beautiful setting.",
                "location": "Viña Montes, Colchagua Valley, Chile",
                "longitude": -71.4939,
                "latitude": -34.6431,
                "imageUrl":"assets/images/venues/chile/vinamontes.png"
            },
            {
                "name": "Casa Lapostolle",
                "description": "Famous for its high-quality wines and stunning architecture, Casa Lapostolle provides a luxurious wine-tasting experience.",
                "location": "Casa Lapostolle, Colchagua Valley, Chile",
                "longitude": -71.3172,
                "latitude": -34.6504,
                "imageUrl":"assets/images/venues/chile/lapostolle.png"
            },
            {
                "name": "Clos Apalta",
                "description": "Esteemed for its iconic wines, Clos Apalta offers an intimate and exclusive wine tasting tour, showcasing its unique terroir and winemaking process.",
                "location": "Clos Apalta, Colchagua Valley, Chile",
                "longitude": -71.2828,
                "latitude": -34.6333,
                "imageUrl":"assets/images/venues/chile/apalta.png"
            }
        ]
    },


    {
        "name": "Visiting Easter Island (Rapa Nui)",
        "category": "Culture",
        "score": 5,
        "description": "Explore the mysterious Moai statues and immerse yourself in the culture and history of Easter Island.",
        "city": "Hanga Roa",
        "longitude": -109.4454,
        "latitude": -27.1127,
        "cost": "$$$",
        "best_time_to_go": ["December", "January", "February", "March"],
        "best_time_to_go_description": "The best time to visit Easter Island is during the Southern Hemisphere's summer months of December to March. These months offer pleasant weather, ideal for exploring the outdoor sites and participating in local festivals, including the Tapati Rapa Nui festival in February.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June, July, and August are the least ideal for visiting Easter Island due to cooler temperatures and heavier rainfall, which can hinder outdoor exploration of the island's archaeological sites.",
        "suggested_venues": [
            {
                "name": "Rano Raraku",
                "description": "The quarry site for the Moai statues, offering a unique glimpse into how these colossal figures were carved and transported.",
                "location": "Rano Raraku, Easter Island",
                "longitude": -109.2898,
                "latitude": -27.1243,
                "imageUrl":"assets/images/venues/chile/ranoraraku.png"
            },
            {
                "name": "Ahu Tongariki",
                "description": "The largest ceremonial platform on Easter Island, featuring 15 restored Moai statues in a breathtaking row against the ocean backdrop.",
                "location": "Ahu Tongariki, Easter Island",
                "longitude": -109.2896,
                "latitude": -27.1211,
                "imageUrl":"assets/images/venues/chile/ahutongariki.png"
            },
            {
                "name": "Orongo",
                "description": "A historic stone village and ceremonial center on the rim of the Rano Kau crater, known for its petroglyphs and Birdman cult stories.",
                "location": "Orongo, Easter Island",
                "longitude": -109.4442,
                "latitude": -27.1867,
                "imageUrl":"assets/images/venues/chile/orongo.png"
            }
        ]
    },


    {
        "name": "Rafting in the Maipo River",
        "category": "Adventure",
        "score": 4,
        "description": "Experience thrilling white-water rafting in the Maipo River, surrounded by breathtaking landscapes.",
        "city": "Santiago",
        "longitude": -70.6483,
        "latitude": -33.4862,
        "cost": "$$",
        "best_time_to_go": ["October", "November", "December", "January", "February", "March"],
        "best_time_to_go_description": "The optimal time for rafting in the Maipo River is from October to March. During these months, the river's water levels are ideal for rafting, offering a combination of exciting rapids and safer conditions. The weather is also more favorable, with warmer temperatures and less rainfall.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June, July, and August are not recommended for rafting in the Maipo River due to lower water levels and colder weather conditions, which can make rafting less enjoyable and more challenging.",
        "suggested_venues": [
            {
                "name": "Cajon del Maipo",
                "description": "A popular spot for outdoor activities, Cajon del Maipo offers exciting rafting experiences with stunning views of the Andean mountains.",
                "location": "Cajon del Maipo, near Santiago, Chile",
                "longitude": -70.3525,
                "latitude": -33.6410,
                "imageUrl":"assets/images/venues/chile/cajonmaipo.png"
            },
            {
                "name": "Embalse el Yeso",
                "description": "Though primarily known for its scenic reservoir, the area around Embalse el Yeso provides excellent rafting opportunities in the upper parts of the Maipo River.",
                "location": "Embalse el Yeso, Maipo River, Chile",
                "longitude": -70.2436,
                "latitude": -33.7333,
                "imageUrl":"assets/images/venues/chile/embalse.png"
            },
            {
                "name": "San Alfonso",
                "description": "A quaint village along the Maipo River that offers a range of rafting trips for all skill levels, set in a picturesque valley.",
                "location": "San Alfonso, Maipo River, Chile",
                "longitude": -70.4733,
                "latitude": -33.6811
                ,"imageUrl":"assets/images/venues/chile/sanalfonso.png"
            }
        ]
    },


    {
        "name": "Exploring Chiloé Island",
        "category": "Culture",
        "score": 4,
        "description": "Discover the unique culture, wooden churches, and beautiful landscapes of Chiloé Island in southern Chile.",
        "city": "Castro",
        "longitude": -73.1245,
        "latitude": -42.4828,
        "cost": "$$",
        "best_time_to_go": ["December", "January", "February", "March"],
        "best_time_to_go_description": "The best time to visit Chiloé Island is during the summer months of December to March. This period offers the most favorable weather for exploring the island's natural beauty, cultural sites, and outdoor activities.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June to August are less ideal for visiting Chiloé Island due to the cold, wet weather, which can limit outdoor exploration and activities.",
        "suggested_venues": [
            {
                "name": "Churches of Chiloé",
                "description": "A series of UNESCO World Heritage Sites, these unique wooden churches represent the fusion of European and indigenous cultural traditions.",
                "location": "Various locations, Chiloé Island, Chile",
                "longitude": -73.1322,
                "latitude": -42.4851,
                "imageUrl":"assets/images/venues/chile/churchchiloe.png"
            },
            {
                "name": "Parque Nacional Chiloé",
                "description": "A national park offering lush forests, diverse wildlife, and beautiful coastal scenery, ideal for hiking and nature walks.",
                "location": "Parque Nacional Chiloé, Chile",
                "longitude": -73.7650,
                "latitude": -42.6333,
                "imageUrl":"assets/images/venues/chile/parquenacional.png"
            },
            {
                "name": "Palafitos de Castro",
                "description": "Iconic colorful stilt houses lining the waterfront in Castro, offering a glimpse into the traditional architectural style of the island.",
                "location": "Palafitos de Castro, Chiloé Island, Chile",
                "longitude": -73.1325,
                "latitude": -42.4808,
                "imageUrl":"assets/images/venues/chile/palafitos.png"
            }
        ]
    },


    {
        "name": "Stargazing in the Elqui Valley",
        "category": "Nature",
        "score": 4,
        "description": "Witness some of the clearest night skies in the world and go stargazing in the Elqui Valley, known for its observatories.",
        "city": "Vicuña",
        "longitude": -70.7163,
        "latitude": -30.0281,
        "cost": "$$",
        "best_time_to_go": ["April", "May", "June", "July", "August"],
        "best_time_to_go_description": "The best time for stargazing in the Elqui Valley is during the winter months of April through August. These months offer clearer skies with less cloud cover and lower humidity, providing optimal conditions for observing the stars and celestial events.",
        "worst_time_to_go": ["December", "January", "February"],
        "worst_time_to_go_description": "The summer months of December to February are less ideal for stargazing in the Elqui Valley due to higher humidity and more frequent cloud cover, which can obscure the clarity of the night skies.",
        "suggested_venues": [
            {
                "name": "Mamalluca Observatory",
                "description": "A popular observatory offering guided night tours to observe the stars, planets, and galaxies through telescopes.",
                "location": "Mamalluca Observatory, Vicuña, Chile",
                "longitude": -70.7399,
                "latitude": -30.0319,
                "imageUrl":"assets/images/venues/chile/mamalluca.png"
            },
            {
                "name": "Cerro Tololo Inter-American Observatory",
                "description": "Home to one of the largest telescopes in the Southern Hemisphere, this observatory provides spectacular views of the night sky.",
                "location": "Cerro Tololo, Elqui Valley, Chile",
                "longitude": -70.8040,
                "latitude": -30.1696,
                "imageUrl":"assets/images/venues/chile/cerrotololo.png"
            },
            {
                "name": "Pangue Observatory",
                "description": "An observatory set in a remote location, perfect for an intimate stargazing experience with minimal light pollution.",
                "location": "Pangue Observatory, Elqui Valley, Chile",
                "longitude": -70.7367,
                "latitude": -30.1575,
                "imageUrl":"assets/images/venues/chile/pangue.png"
            }
        ]
    },


    {
        "name": "Skiing in the Andes Mountains",
        "category": "Adventure",
        "score": 3,
        "description": "Hit the slopes and enjoy skiing or snowboarding in the Andes Mountains during the winter season.",
        "city": "Santiago",
        "longitude": -70.6483,
        "latitude": -33.4862,
        "cost": "$$$",
        "best_time_to_go": ["June", "July", "August", "September"],
        "best_time_to_go_description": "The best time for skiing in the Andes Mountains is during the winter months of June to September. During this time, the mountains receive ample snowfall, providing excellent conditions for skiing and snowboarding.",
        "worst_time_to_go": ["December", "January", "February"],
        "worst_time_to_go_description": "The summer months of December to February are the least favorable for skiing in the Andes Mountains, as there is little to no snowfall, making skiing activities impossible.",
        "suggested_venues": [
            {
                "name": "Valle Nevado Ski Resort",
                "description": "One of the largest ski resorts in South America, offering a wide range of slopes for all levels and stunning mountain views.",
                "location": "Valle Nevado, near Santiago, Chile",
                "longitude": -70.1974,
                "latitude": -33.3564,
                "imageUrl":"assets/images/venues/chile/vallenevado.png"
            },
            {
                "name": "Portillo Ski Resort",
                "description": "A world-renowned ski resort known for its unique terrain and beautiful setting near the Laguna del Inca.",
                "location": "Portillo, near Santiago, Chile",
                "longitude": -70.1283,
                "latitude": -32.8583,
                "imageUrl":"assets/images/venues/chile/portillo.png"
            },
            {
                "name": "El Colorado Ski Resort",
                "description": "Popular among locals and tourists alike, El Colorado offers a variety of ski trails and stunning panoramic views.",
                "location": "El Colorado, near Santiago, Chile",
                "longitude": -70.2456,
                "latitude": -33.3500
                ,"imageUrl":"assets/images/venues/chile/colorado.png"
            }
        ]
    },

    {
        "name": "Exploring Valparaíso's Colorful Streets",
        "category": "Culture",
        "score": 4,
        "description": "Wander through the vibrant and artistic streets of Valparaíso, known for its colorful murals and bohemian atmosphere.",
        "city": "Valparaíso",
        "longitude": -71.6273,
        "latitude": -33.0472,
        "cost": "$",
        "best_time_to_go": ["September", "October", "November", "March", "April", "May"],
        "best_time_to_go_description": "The best time to explore Valparaíso's colorful streets is during the spring and autumn months of September to November and March to May. During these months, the weather is mild, and the city's artistic scenes and outdoor activities are at their most vibrant.",
        "worst_time_to_go": ["June", "July", "August"],
        "worst_time_to_go_description": "The winter months of June to August are less ideal for exploring Valparaíso due to colder, rainier weather which can hinder the experience of wandering through its colorful streets and outdoor murals.",
        "suggested_venues": [
            {
                "name": "Cerro Concepción and Cerro Alegre",
                "description": "These adjoining hills are famous for their colorful buildings, street art, and stunning views of the city and sea.",
                "location": "Cerro Concepción and Cerro Alegre, Valparaíso, Chile",
                "longitude": -71.6259,
                "latitude": -33.0456,
                "imageUrl":"assets/images/venues/chile/cerroalegre.png"
            },
            {
                "name": "Museo a Cielo Abierto",
                "description": "An open-air museum featuring large-scale murals by various artists, showcasing the cultural and artistic heritage of Valparaíso.",
                "location": "Museo a Cielo Abierto, Valparaíso, Chile",
                "longitude": -71.6163,
                "latitude": -33.0522,
                "imageUrl":"assets/images/venues/chile/cieloabierto.png"
            },
            {
                "name": "Paseo Gervasoni",
                "description": "A picturesque walkway offering a collection of street art, artisanal shops, and cafes with a view of the bay.",
                "location": "Paseo Gervasoni, Valparaíso, Chile",
                "longitude": -71.6252,
                "latitude": -33.0425,
                "imageUrl":"assets/images/venues/chile/paseogervasoni.png"
            }
        ]
    }    
]
